jabezwinston/arduino-pc-native/boards.txt
# PC simulator
pcsim.name=PC simulator

pcsim.upload.tool=none
pcsim.upload.protocol=runtime
pcsim.upload.params.verbose=
pcsim.upload.pattern={build.path}/{build.project_name}.elf

pcsim.bootloader.tool=none

pcsim.build.mcu=native
pcsim.build.board=PCSIM
pcsim.build.core=pcsim
pcsim.build.variant=standard
